## Terraform Plan Result


### environments/stg/network/sg
```
  + create
  - destroy
  - resource "aws_security_group_rule" "this_sg" {
      - description              = "Allow MySQL from app servers" -> null
      - from_port                = 3306 -> null
      - id                       = "sgrule-2984917782" -> null
      - protocol                 = "tcp" -> null
      - region                   = "ap-southeast-2" -> null
      - security_group_id        = "sg-0bef1af671db10afd" -> null
      - security_group_rule_id   = "sgr-0ae907e4dc1dc3391" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0513a4b88ab3790e9" -> null
      - to_port                  = 3306 -> null
      - type                     = "ingress" -> null
  + resource "aws_security_group_rule" "this_use_sg" {
      + description              = "Allow MySQL from app servers"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-2"
      + security_group_id        = "sg-0bef1af671db10afd"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0513a4b88ab3790e9"
      + to_port                  = 3306
      + type                     = "ingress"
  - resource "aws_security_group_rule" "this_cidr" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
      - description            = "Allow HTTP" -> null
      - from_port              = 80 -> null
      - id                     = "sgrule-3773784967" -> null
      - protocol               = "tcp" -> null
      - region                 = "ap-southeast-2" -> null
      - security_group_id      = "sg-0513a4b88ab3790e9" -> null
      - security_group_rule_id = "sgr-020a22912f6f804fe" -> null
      - self                   = false -> null
      - to_port                = 80 -> null
      - type                   = "ingress" -> null
  + resource "aws_security_group_rule" "this_use_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
      + description              = "Allow HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-2"
      + security_group_id        = "sg-0513a4b88ab3790e9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
  + resource "aws_security_group_rule" "this_use_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
      + description              = "Allow HTTPs"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-2"
      + security_group_id        = "sg-0513a4b88ab3790e9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
  - resource "aws_security_group_rule" "this_cidr" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
      - description            = "Allow all outbound traffic" -> null
      - from_port              = 0 -> null
      - id                     = "sgrule-4198438869" -> null
      - protocol               = "-1" -> null
      - region                 = "ap-southeast-2" -> null
      - security_group_id      = "sg-0513a4b88ab3790e9" -> null
      - security_group_rule_id = "sgr-00c1ffcaa52899e02" -> null
      - self                   = false -> null
      - to_port                = 0 -> null
      - type                   = "egress" -> null
  + resource "aws_security_group_rule" "this_use_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + region                   = "ap-southeast-2"
      + security_group_id        = "sg-0513a4b88ab3790e9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
  - resource "aws_security_group_rule" "this_cidr" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
      - description            = "Custom SSH port" -> null
      - from_port              = 8080 -> null
      - id                     = "sgrule-2530122292" -> null
      - protocol               = "tcp" -> null
      - region                 = "ap-southeast-2" -> null
      - security_group_id      = "sg-0513a4b88ab3790e9" -> null
      - security_group_rule_id = "sgr-0e39a70909b5ad02d" -> null
      - self                   = false -> null
      - to_port                = 8080 -> null
      - type                   = "ingress" -> null
  + resource "aws_security_group_rule" "this_use_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
      + description              = "Custom SSH port"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-2"
      + security_group_id        = "sg-0513a4b88ab3790e9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
  - resource "aws_security_group_rule" "this_cidr" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
      - description            = "Custom TCP port" -> null
      - from_port              = 1024 -> null
      - id                     = "sgrule-1020207206" -> null
      - protocol               = "tcp" -> null
      - region                 = "ap-southeast-2" -> null
      - security_group_id      = "sg-0513a4b88ab3790e9" -> null
      - security_group_rule_id = "sgr-043ae2cb64712c223" -> null
      - self                   = false -> null
      - to_port                = 65535 -> null
      - type                   = "ingress" -> null
  + resource "aws_security_group_rule" "this_use_cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
      + description              = "Custom TCP port"
      + from_port                = 1024
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-2"
      + security_group_id        = "sg-0513a4b88ab3790e9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
Plan: 6 to add, 0 to change, 5 to destroy.
```
<!-- Sticky Pull Request Commentterraform-plan -->